[
    {
        "email": "kholoud4kam@gmail.com",
        "password": "123456789",
        "username": "kholouudd__",
        "date": "2024-07-13 10:22:37",
        "favorites": [
            {
                "_id": 8,
                "title": "Java Programming for Beginners",
                "isbn": "978-0596009205",
                "pageCount": 384,
                "publishedDate": "2023-07-01",
                "thumbnailUrl": "https://img.freepik.com/free-photo/book-composition-with-open-book_23-2147690555.jpg",
                "shortDescription": "Learn Java programming from scratch.",
                "longDescription": "A practical guide for beginners to learn Java programming, with step-by-step examples and exercises.",
                "status": "PUBLISH",
                "authors": [
                    "Daniel Green"
                ],
                "categories": [
                    "Java"
                ]
            },
            {
                "_id": 4,
                "title": "Internet Security Essential",
                "isbn": "978-1119510625",
                "pageCount": 276,
                "publishedDate": "2023-03-20",
                "thumbnailUrl": "https://img.freepik.com/free-photo/book-composition-with-open-book_23-2147690555.jpg",
                "shortDescription": "Understand the basics of internet security.",
                "longDescription": "This book provides an overview of internet security principles, including encryption, firewalls, and threat management.",
                "status": "Under review",
                "authors": [
                    "Michael Johnson"
                ],
                "categories": [
                    "internet"
                ]
            }
        ]
    },
    {
        "email": "kh@gmail.com",
        "password": "123456789",
        "username": "kholouudd__",
        "date": "2024-07-13 10:25:51",
        "favorites": []
    },
    {
        "email": "moustafa@gmail.com",
        "password": "123456789",
        "username": "moustafa",
        "date": "2024-07-14 15:41:34",
        "favorites": []
    },
    {
        "email": "nora@gmail.com",
        "password": "123456789",
        "username": "nora",
        "date": "2024-07-14 16:39:57",
        "favorites": []
    },
    {
        "email": "admin@admin.com",
        "password": "123456789",
        "username": "admin",
        "date": "2024-07-14 16:39:57",
        "favorites": [
            {
                "_id": 4,
                "title": "Internet Security Essential",
                "isbn": "978-1119510625",
                "pageCount": 276,
                "publishedDate": "2023-03-20",
                "thumbnailUrl": "https://img.freepik.com/free-photo/book-composition-with-open-book_23-2147690555.jpg",
                "shortDescription": "Understand the basics of internet security.",
                "longDescription": "This book provides an overview of internet security principles, including encryption, firewalls, and threat management.",
                "status": "Under review",
                "authors": [
                    "Michael Johnson"
                ],
                "categories": [
                    "internet"
                ]
            }
        ]
    },
    {
        "email": "saleem@gmail.com",
        "password": "123456789",
        "username": "saleem",
        "date": "2024-07-20 15:54:10",
        "favorites": [
            {
                "_id": 11,
                "title": "Flexible Rails",
                "isbn": "1933988509",
                "pageCount": 592,
                "publishedDate": {
                    "$date": "2008-01-01T00:00:00.000-0800"
                },
                "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/armstrong.jpg",
                "shortDescription": "\"Flexible Rails created a standard to which I hold other technical books. You definitely get your money's worth.\"",
                "longDescription": "Rails is a fantastic tool for web application development, but its Ajax-driven interfaces stop short of the richness you gain with a tool like Adobe Flex. Simply put, Flex is the most productive way to build the UI of rich Internet applications, and Rails is the most productive way to rapidly build a database-backed CRUD application. Together, they're an amazing combination.    Flexible Rails is a book about how to use Ruby on Rails and Adobe Flex to build next-generation rich Internet applications (RIAs). The book takes you to the leading edge of RIA development, presenting examples in Flex 3 and Rails 2.    This book is not an exhaustive Ruby on Rails tutorial, nor a Flex reference manual. (Adobe ships over 3000 pages of PDF reference documentation with Flex.) Instead, it's an extensive tutorial, developed iteratively, how to build an RIA using Flex and Rails together. You learn both the specific techniques you need to use Flex and Rails together as well as the development practices that make the combination especially powerful.    The example application built in the book is MIT-licensed, so readers can use it as the basis for their own applications. In fact, one reader has already built an agile project management tool based on the book example!    With this book, you learn Flex by osmosis. You can read the book and follow along even if you have never used Flex before. Consider it \"Flex Immersion.\" You absorb the key concepts of Flex as you go through the process of building the application.    You will also learn how Flex and Rails integrate with HTTPService and XML, and see how RESTful Rails controller design gracefully supports using the same controller actions for Flex and HTML clients. The author will show you how Cairngorm can be used to architect larger Flex applications, including tips to use Cairngorm in a less verbose way with HTTPService to talk to Rails.    Flexible Rails is for both Rails developers who are interested in Flex, and Flex developers who are interested in Rails. For a Rails developer, Flex allows for more dynamic and engaging user interfaces than are possible with Ajax. For a Flex developer, Rails provides a way to rapidly build the ORM and services layer of the application.",
                "status": "PUBLISHED",
                "authors": [
                    "Peter Armstrong"
                ],
                "categories": [
                    "Web Development"
                ]
            },
            {
                "_id": 13,
                "title": "Hello! Flex 4",
                "isbn": "1933988762",
                "pageCount": 258,
                "publishedDate": {
                    "$date": "2009-11-01T00:00:00.000-0700"
                },
                "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/armstrong3.jpg",
                "shortDescription": "Hello! Flex 4 progresses through 26 self-contained examples selected so you can progressively master Flex. They vary from small one-page apps, to a 3D rotating haiku, to a Connect Four-like game. And in the last chapter you'll learn to build a full Flex application called SocialStalkr   a mashup that lets you follow your friends by showing their tweets on a Yahoo map.",
                "longDescription": "With Flex 4 you can easily add color and life to your web applications by introducing dynamic user features, slick transitions, and eye-catching animations. Flex also provides powerful data handling capabilities so you can build industrial-strength applications. And it's open source, so you can get started without forking over a lot of your hard-earned cash.    We think it should be just as much fun to learn Flex as it is to use Flex. Hello! Flex 4 shows you everything you need to know to get started with Flex 4 without bogging you down in obscure detail or academic edge cases. In this entertaining, hands-on book, you'll quickly move from Hello World into the techniques you'll need to use Flex effectively.    You'll start by progressing through 26 self-contained workshop items, which include everything from small one-page examples, to a 3D rotating haiku, to building a Connect Four game. Finally, in the last chapter you'll build a full Flex application called 'SocialStalkr': an interesting mashup of Twitter and Yahoo Maps that lets you 'stalk' your friends by showing specially formatted Twitter tweets on a Yahoo map.",
                "status": "PUBLISH",
                "authors": [
                    "Peter Armstrong"
                ],
                "categories": [
                    "Internet"
                ]
            },
            {
                "_id": 16,
                "title": "Brownfield Application Development in .NET",
                "isbn": "1933988711",
                "pageCount": 550,
                "publishedDate": {
                    "$date": "2010-04-16T00:00:00.000-0700"
                },
                "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/baley.jpg",
                "shortDescription": "Brownfield Application Development in .Net shows you how to approach legacy applications with the state-of-the-art concepts, patterns, and tools you've learned to apply to new projects. Using an existing application as an example, this book guides you in applying the techniques and best practices you need to make it more maintainable and receptive to change.",
                "longDescription": "It's easy to get excited about building a new software project from scratch. So-called \"greenfield\" projects often involve learning new technology and the opportunity for experimentation. Working on established software projects may seem less glamorous.    Most software developers have inherited a monolithic application where the day-to-day tasks involve maintenance, incremental improvements, or even cleaning up the mess another programmer left behind. These legacy or brownfield projects often have tightly coupled components, low cohesion, and poor separation of concerns, making them fragile and resistant to change.    Brownfield Application Development in .Net shows you how to approach legacy applications with the state-of-the-art concepts, patterns, and tools you've learned to apply to new projects. Using an existing application as an example, this book guides you in applying the techniques and best practices you need to make it more maintainable and receptive to change.    Starting with the build process and the introduction of unit tests, the authors show you how to set up the application so that in later chapters, you can make incremental changes aimed at decoupling components from each other. Each practice introduced will increase your confidence and ability to make subsequent changes to your code.    As the book proceeds, the authors introduce frameworks and tools commonly used today while still approaching the subject from a conceptual level so that you can substitute alternate tools as appropriate. This book examines the reasons why a tool is necessary, not the tool itself. Because the book is based on the authors' experiences, Brownfield Application Development in .Net moves beyond the theories and shows you the techniques you need to be successful.",
                "status": "PUBLISH",
                "authors": [
                    "Kyle Baley",
                    "Donald Belcham"
                ],
                "categories": [
                    "Microsoft"
                ]
            },
            {
                "_id": 10,
                "title": "OSGi in Depth",
                "isbn": "193518217X",
                "pageCount": 325,
                "publishedDate": {
                    "$date": "2011-12-12T00:00:00.000-0800"
                },
                "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/alves.jpg",
                "shortDescription": "Enterprise OSGi shows a Java developer how to develop to the OSGi Service Platform Enterprise specification, an emerging Java-based technology for developing modular enterprise applications. Enterprise OSGi addresses several shortcomings of existing enterprise platforms, such as allowing the creation of better maintainable and extensible applications, and provide a simpler, easier-to-use, light-weight solution to enterprise software development.",
                "longDescription": "A good application framework greatly simplifies a developer's task by providing reusable code modules that solve common, tedious, or complex tasks. Writing a great framework requires an extraordinary set of skills-ranging from deep knowledge of a programming language and target platform to a crystal-clear view of the problem space where the applications to be developed using the framework will be used.    OSGi Application Frameworks shows a Java developer how to build frameworks based on the OSGi service platform. OSGi, an emerging Java-based technology for developing modular applications, is a great tool for framework building. A framework itself, OSGi allows the developer to create a more intuitive, modular framework by isolating many of the key challenges the framework developer faces.    This book begins by describing the process, principles, and tools you must master to build a custom application framework. It introduces the fundamental concepts of OSGi, and then shows you how to put OSGi to work building various types of frameworks that solve specific development problems.    OSGi is particularly useful for building frameworks that can be easily extended by developers to create domain-specific applications. This book teaches the developer to break down a problem domain into its abstractions and then use OSGi to create a modular framework solution. Along the way, the developer learns software engineering practices intrinsic to framework building that result in systems with better software qualities, such as flexibility, extensibility, and maintainability.    Author Alexandre Alves guides you through major concepts, such as the definition of programming models and modularization techniques, and complements them with samples that have real applicability using industry-proved technologies, such as Spring-DM and Equinox.",
                "status": "PUBLISH",
                "authors": [
                    "Alexandre de Castro Alves"
                ],
                "categories": [
                    "Java"
                ]
            },
            {
                "_id": 308,
                "title": "Bitter Java",
                "isbn": "193011043X",
                "pageCount": 368,
                "publishedDate": {
                    "$date": "2002-03-01T00:00:00.000-0800"
                },
                "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/tate.jpg",
                "shortDescription": "It is a well-known fact that most software projects fail. Drawing important lessons from common failures is the goal of Bitter Java.    Reusing design patterns is not enough for success: patterns are like partial maps of dangerous terrain. They help, but don't prevent you from getting lost. Bitter Java teaches you how to recognize when you are lost, and how to get back on the right path. It illustrates common pitfalls of Java programming through code examples; it then refactors the code and explains why the new solutions are safe.    This book is a systematic account of common server-side Java programming mistakes, their causes and solutions. It covers antipatterns for base Java and J2EE concepts such as Servlets, JSPs, EJBs, enterprise connection models, and scalability. If you are an intermediate Java programmer, analyst or architect eager to avoid the bitter experiences of others, this book is for you.",
                "longDescription": "It is a well-known fact that most software projects fail. Drawing important lessons from common failures is the goal of Bitter Java.    Reusing design patterns is not enough for success: patterns are like partial maps of dangerous terrain. They help, but don't prevent you from getting lost. Bitter Java teaches you how to recognize when you are lost, and how to get back on the right path. It illustrates common pitfalls of Java programming through code examples; it then refactors the code and explains why the new solutions are safe.    This book is a systematic account of common server-side Java programming mistakes, their causes and solutions. It covers antipatterns for base Java and J2EE concepts such as Servlets, JSPs, EJBs, enterprise connection models, and scalability. If you are an intermediate Java programmer, analyst or architect eager to avoid the bitter experiences of others, this book is for you.",
                "status": "PUBLISH",
                "authors": [
                    "Bruce A. Tate"
                ],
                "categories": [
                    "Java",
                    "Business",
                    "Client Server",
                    ""
                ]
            }
        ]
    },
    {
        "email": "hsmf@gmsil.vo",
        "password": "123",
        "username": "hazem",
        "date": "2024-07-22 10:44:16",
        "favorites": [
            {
                "_id": 273,
                "title": "The Awesome Power of Java Beans",
                "isbn": "1884777562",
                "pageCount": 500,
                "publishedDate": {
                    "$date": "1998-05-01T00:00:00.000-0700"
                },
                "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/rodrigues.jpg",
                "shortDescription": "Build your own bean  Or use one that's ready-made  The Awesome Power of Java Beans provides the details on both. Either way, the power of Java Beans is awesome: once created, your beans run anywhere-- ceven masquerading as an ActiveX control.    The Awesome Power of Java Beans shows you how to use not only BeanBox, but also such tools as VisualAge WebRunner, JBuilder and PowerJ. And there's a wide-ranging selection of completed and tested beans for you to use in your applications    If you're a Java programmer, teacher or student, or if you design software systems using Java Beans, this book will be a valuable resource.",
                "longDescription": "Build your own bean  Or use one that's ready-made  The Awesome Power of Java Beans provides the details on both. Either way, the power of Java Beans is awesome: once created, your beans run anywhere-- ceven masquerading as an ActiveX control.    The Awesome Power of Java Beans shows you how to use not only BeanBox, but also such tools as VisualAge WebRunner, JBuilder and PowerJ. And there's a wide-ranging selection of completed and tested beans for you to use in your applications    If you're a Java programmer, teacher or student, or if you design software systems using Java Beans, this book will be a valuable resource.",
                "status": "PUBLISH",
                "authors": [
                    "Lawrence H. Rodrigues"
                ],
                "categories": [
                    "Java"
                ]
            },
            {
                "_id": 14,
                "title": "Coffeehouse",
                "isbn": "1884777384",
                "pageCount": 316,
                "publishedDate": {
                    "$date": "1997-07-01T00:00:00.000-0700"
                },
                "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/asher.jpg",
                "shortDescription": "Coffeehouse is an anthology of stories, poems and essays originally published on the World Wide Web.",
                "longDescription": "Coffeehouse is an anthology of stories, poems and essays originally published on the World Wide Web. The purpose is to capture the zeitgeist of the web's creative community, and to give readers a chance to enjoy some of the best and most notable original works that have appeared in this form. It showcases over forty individual web writers, among them Joseph Squier, Martha Conway, Jason Snell, David Alexander, Carl Steadman and Walter Miller. The intent is to show the variety and vitality of the web's blossoming literary \"scene,\" and to capture the unique and highly iconoclastic \"personality\" of the web community.",
                "status": "PUBLISHED",
                "authors": [
                    "Levi Asher",
                    "Christian Crumlish"
                ],
                "categories": [
                    "Miscellaneous"
                ]
            },
            {
                "_id": 16,
                "title": "Brownfield Application Development in .NET",
                "isbn": "1933988711",
                "pageCount": 550,
                "publishedDate": {
                    "$date": "2010-04-16T00:00:00.000-0700"
                },
                "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/baley.jpg",
                "shortDescription": "Brownfield Application Development in .Net shows you how to approach legacy applications with the state-of-the-art concepts, patterns, and tools you've learned to apply to new projects. Using an existing application as an example, this book guides you in applying the techniques and best practices you need to make it more maintainable and receptive to change.",
                "longDescription": "It's easy to get excited about building a new software project from scratch. So-called \"greenfield\" projects often involve learning new technology and the opportunity for experimentation. Working on established software projects may seem less glamorous.    Most software developers have inherited a monolithic application where the day-to-day tasks involve maintenance, incremental improvements, or even cleaning up the mess another programmer left behind. These legacy or brownfield projects often have tightly coupled components, low cohesion, and poor separation of concerns, making them fragile and resistant to change.    Brownfield Application Development in .Net shows you how to approach legacy applications with the state-of-the-art concepts, patterns, and tools you've learned to apply to new projects. Using an existing application as an example, this book guides you in applying the techniques and best practices you need to make it more maintainable and receptive to change.    Starting with the build process and the introduction of unit tests, the authors show you how to set up the application so that in later chapters, you can make incremental changes aimed at decoupling components from each other. Each practice introduced will increase your confidence and ability to make subsequent changes to your code.    As the book proceeds, the authors introduce frameworks and tools commonly used today while still approaching the subject from a conceptual level so that you can substitute alternate tools as appropriate. This book examines the reasons why a tool is necessary, not the tool itself. Because the book is based on the authors' experiences, Brownfield Application Development in .Net moves beyond the theories and shows you the techniques you need to be successful.",
                "status": "PUBLISH",
                "authors": [
                    "Kyle Baley",
                    "Donald Belcham"
                ],
                "categories": [
                    "Microsoft"
                ]
            }
        ]
    },
    {
        "email": "er@fg.com",
        "password": "1234",
        "username": "kholouudd__",
        "date": "2024-07-22 11:27:41",
        "favorites": []
    },
    {
        "email": "qw@gmail.com",
        "password": "12345",
        "username": "kholouudd__",
        "date": "2024-07-22 11:29:40",
        "favorites": []
    },
    {
        "email": "sd@hg.com",
        "password": "12",
        "username": "kholouudd__",
        "date": "2024-07-22 11:43:05",
        "favorites": []
    },
    {
        "email": "sdk@hg.com",
        "password": "12345",
        "username": "kholouudd__",
        "date": "2024-07-22 11:44:09",
        "favorites": []
    },
    {
        "email": "vb@gmail.com",
        "password": "Kholoud1412002@",
        "username": "kholouudd__",
        "date": "2024-07-22 11:47:40",
        "favorites": []
    },
    {
        "email": "t-2747@ischoolteams.com",
        "password": "Kholoud14",
        "username": "kholouudd__",
        "date": "2024-07-22 11:48:13",
        "favorites": []
    },
    {
        "email": "kj@gmail.com",
        "password": "123",
        "username": "kholouudd__",
        "date": "2024-07-22 11:49:58",
        "favorites": []
    },
    {
        "email": "bn@gmail.com",
        "password": "nm",
        "username": "kholouudd__",
        "date": "2024-07-22 11:53:07",
        "favorites": []
    },
    {
        "email": "ty@gmail.com",
        "password": "1234567@",
        "username": "kholouudd__",
        "date": "2024-07-22 11:55:47",
        "favorites": []
    },
    {
        "email": "xc@gmail.com",
        "password": "1234567b@",
        "username": "kholouudd__",
        "date": "2024-07-22 11:57:10",
        "favorites": []
    },
    {
        "email": "mn@gmail.com",
        "password": "Kholoud1412002$",
        "username": "kholouudd__",
        "date": "2024-07-22 14:55:13",
        "favorites": [
            {
                "_id": 4,
                "title": "Internet Security Essential",
                "isbn": "978-1119510625",
                "pageCount": 276,
                "publishedDate": "2023-03-20",
                "thumbnailUrl": "https://img.freepik.com/free-photo/book-composition-with-open-book_23-2147690555.jpg",
                "shortDescription": "Understand the basics of internet security.",
                "longDescription": "This book provides an overview of internet security principles, including encryption, firewalls, and threat management.",
                "status": "PUBLISH",
                "authors": [
                    "Michael Johnson"
                ],
                "categories": [
                    "internet"
                ]
            },
            {
                "_id": 15,
                "title": "Introduction to Internet Technologies",
                "isbn": "978-0134670946",
                "pageCount": 270,
                "publishedDate": "2024-03-15",
                "thumbnailUrl": "https://img.freepik.com/free-photo/book-composition-with-open-book_23-2147690555.jpg",
                "shortDescription": "An introduction to key internet technologies.",
                "longDescription": "This book provides an overview of fundamental internet technologies, including HTTP, HTML, and web servers.",
                "status": "Done",
                "authors": [
                    "Zoe Adams"
                ],
                "categories": [
                    "internet"
                ]
            },
            {
                "_id": 7,
                "title": "Modern Web Design",
                "isbn": "978-1119293561",
                "pageCount": 256,
                "publishedDate": "2023-04-12",
                "thumbnailUrl": "https://img.freepik.com/free-photo/book-composition-with-open-book_23-2147690555.jpg",
                "shortDescription": "Design stunning websites with modern techniques.",
                "longDescription": "Learn about the latest trends and techniques in web design, including UX/UI principles and design tools.",
                "status": "Done",
                "authors": [
                    "Olivia Davis"
                ],
                "categories": [
                    "Web Development"
                ]
            }
        ]
    },
    {
        "email": "cv@gmail.com",
        "password": "Kholoud1412992@",
        "username": "cv",
        "date": "2024-07-22 15:33:45",
        "favorites": [
            {
                "_id": 4,
                "title": "Internet Security Essential",
                "isbn": "978-1119510625",
                "pageCount": 276,
                "publishedDate": "2023-03-20",
                "thumbnailUrl": "https://img.freepik.com/free-photo/book-composition-with-open-book_23-2147690555.jpg",
                "shortDescription": "Understand the basics of internet security.",
                "longDescription": "This book provides an overview of internet security principles, including encryption, firewalls, and threat management.",
                "status": "Under review",
                "authors": [
                    "Michael Johnson"
                ],
                "categories": [
                    "internet"
                ]
            }
        ]
    }
]